# –°–æ–∑–¥–∞–Ω–∏–µ –∏ –Ω–æ—Ä–º–∞–ª–∏–∑–∞—Ü–∏—è –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö.

## –ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞

In [1]:
import pandas as pd
from sqlalchemy import create_engine, text

import os
from dotenv import load_dotenv

import warnings
warnings.filterwarnings("ignore")

# –ö—Ä–µ–¥—ã –¥–ª—è –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è –∫ PostgreSQL. –ü–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è –∏ –ø–∞—Ä–æ–ª—å –±–µ—Ä—ë–º –∏–∑ .env
user = os.getenv("POSTGRES_USER")
password = os.getenv("POSTGRES_PASSWORD")
host = "localhost"
port = 5432
database = "db1"

# –°–æ–∑–¥–∞—ë–º –¥–≤–∏–∂–æ–∫ –¥–ª—è —Ä–∞–±–æ—Ç—ã —Å –±–∞–∑–æ–π
engine = create_engine(f"postgresql+psycopg2://{user}:{password}@{host}:{port}/{database}")

# –§—É–Ω–∫—Ü–∏—è –¥–ª—è —Å–æ–∑–¥–∞–Ω–∏—è —Å—Ö–µ–º –∏ —Ç–∞–±–ª–∏—Ü
def execute_query(sql):
    with engine.connect() as conection:
        try:
            conection.execute(text(sql))
            conection.commit()
            print("–ó–∞–ø—Ä–æ—Å —É—Å–ø–µ—à–Ω–æ –≤—ã–ø–æ–ª–Ω–µ–Ω! üéâüéâüéâ")
        except Exception as e:
            print(f"–ü—Ä–∏ –≤—ã–ø–æ–ª–Ω–µ–Ω–∏–∏ –∑–∞–ø—Ä–æ—Å–∞ –≤–æ–∑–Ω–∏–∫–ª–∞ –æ—à–∏–±–∫–∞: {e}")

–ß–∏—Ç–∞–µ–º –ø–µ—Ä–≤—ã–π –ª–∏—Å—Ç —Å —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏—è–º–∏

In [2]:
transactions = pd.read_excel("customer_and_transaction.xlsx", sheet_name="transaction")
transactions.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standart_cost
0,1,2,2950,2017-02-25,False,Approved,Solex,Standard,medium,medium,71.49,53.62
1,2,3,3120,2017-05-21,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92
2,3,37,402,2017-10-16,False,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82
3,4,88,3135,2017-08-31,False,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10
4,5,78,787,2017-10-01,True,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48

–ü—Ä–æ–≤–µ—Ä—è–µ–º –ø—Ä–æ–ø—É—Å–∫–∏

In [3]:
transactions.isna().sum()

transaction_id        0
product_id            0
customer_id           0
transaction_date      0
online_order        360
order_status          0
brand               197
product_line        197
product_class       197
product_size        197
list_price            0
standart_cost       197
dtype: int64

–ß–∏—Ç–∞–µ–º –≤—Ç–æ—Ä–æ–π –ª–∏—Å—Ç —Å –∫–ª–∏–µ–Ω—Ç–∞–º–∏

In [4]:
customers = pd.read_excel("customer_and_transaction.xlsx", sheet_name="customer")
customers.head()

,customer_id,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12 00:00:00,Executive Secretary,Health,Mass Customer,N,Yes,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,1980-12-16 00:00:00,Administrative Officer,Financial Services,Mass Customer,N,Yes,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,3,Arlin,Dearle,Male,1954-01-20 00:00:00,Recruiting Manager,Property,Mass Customer,N,Yes,0 Holy Cross Court,4211,QLD,Australia,9
3,4,Talbot,NaN,Male,1961-10-03 00:00:00,NaN,IT,Mass Customer,N,No,17979 Del Mar Point,2448,New South Wales,Australia,4
4,5,Sheila-kathryn,Calton,Female,1977-05-13 00:00:00,Senior Editor,NaN,Affluent Customer,N,Yes,9 Oakridge Court,3216,VIC,Australia,9

–¢–∞–∫ –∂–µ –ø—Ä–æ–≤–µ—Ä—è–µ–º –ø—Ä–æ–ø—É—Å–∫–∏

In [5]:
customers.isna().sum()

customer_id                0
first_name                 0
last_name                125
gender                     0
DOB                       87
job_title                506
job_industry_category    656
wealth_segment             0
deceased_indicator         0
owns_car                   0
address                    0
postcode                   0
state                      0
country                    0
property_valuation         0
dtype: int64

## –ó–∞–¥–∞–Ω–∏–µ 1. –ü—Ä–æ–¥—É–º–∞—Ç—å —Å—Ç—Ä—É–∫—Ç—É—Ä—É –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö –∏ –æ—Ç—Ä–∏—Å–æ–≤–∞—Ç—å –≤ —Ä–µ–¥–∞–∫—Ç–æ—Ä–µ

–°—Ç—Ä—É–∫—Ç—É—Ä–∞ –ë–î –∫–æ–Ω—Ü–µ–ø—Ç—É–∞–ª—å–Ω–æ –±—É–¥–µ—Ç –≤—ã–≥–ª—è–¥–µ—Ç—å —Å–ª–µ–¥—É—é—â–∏–º –æ–±—Ä–∞–∑–æ–º  
  
![–ï—Å–ª–∏ –∏–∑–æ–±—Ä–∞–∂–µ–Ω–∏–µ –Ω–µ –∑–∞–≥—Ä—É–∑–∏–ª–æ—Å—å, —Ç–æ —Å—Ö–µ–º–∞ –ë–î –Ω–∞—Ö–æ–¥–∏—Ç—Å—è –≤ –ø–∞–ø–∫–µ –ø—Ä–æ–µ–∫—Ç–∞](–°—Ö–µ–º–∞_–ë–î.png)  
  
–û–¥–Ω–∞–∫–æ –ø—Ä–µ–¥–≤–∞—Ä–∏—Ç–µ–ª—å–Ω–æ –Ω—É–∂–Ω–æ –ø—Ä–µ–æ–±—Ä–∞–∑–æ–≤–∞—Ç—å –¥–∞–Ω–Ω—ã–µ –≤ –Ω—É–∂–Ω—ã–π —Ñ–æ—Ä–º–∞—Ç

## –ó–∞–¥–∞–Ω–∏–µ 2. –ù–æ—Ä–º–∞–ª–∏–∑–æ–≤–∞—Ç—å –±–∞–∑—É –¥–∞–Ω–Ω—ã—Ö (1–ù–§ ‚Äî 3–ù–§), –æ–ø–∏—Å–∞–≤, –∫ –∫–∞–∫–æ–π –Ω–æ—Ä–º–∞–ª—å–Ω–æ–π —Ñ–æ—Ä–º–µ –ø—Ä–∏–≤–æ–¥–∏—Ç—Å—è —Ç–∞–±–ª–∏—Ü–∞ –∏ –ø–æ—á–µ–º—É —Ç–∞–±–ª–∏—Ü–∞ –≤ —ç—Ç–æ–π –Ω–æ—Ä–º–∞–ª—å–Ω–æ–π —Ñ–æ—Ä–º–µ –∏–∑–Ω–∞—á–∞–ª—å–Ω–æ –Ω–µ –Ω–∞—Ö–æ–¥–∏–ª–∞—Å—å.

–ü—Ä–∏–≤–µ–¥—ë–º –Ω–∞—à–∏ –¥–∞–Ω–Ω—ã–µ –∫ 2–ù–§, –≤ —Å–æ–æ—Ç–≤–µ—Ç—Å—Ç–≤–∏–∏ —Å–æ —Å—Ö–µ–º–æ–π –≤—ã—à–µ. –ò–∑–Ω–∞—á–∞–ª—å–Ω–∞—è —Ç–∞–±–ª–∏—Ü–∞ –Ω–∞—Ö–æ–¥–∏–ª–∞—Å—å –≤ 1–ù–§ –ø–æ—Ç–æ–º—É —á—Ç–æ –≤—Å–µ –∞—Ç—Ä–∏–±—É—Ç—ã –±—ã–ª–∏ –ø—Ä–æ—Å—Ç—ã–º–∏, –æ–¥–Ω–∞–∫–æ —á–∞—Å—Ç—å —Å—Ç–æ–ª–±—Ü–æ–≤ –Ω–∞ –ª–∏—Å—Ç–µ _transaction_ –∑–∞–≤–∏—Å–µ–ª–∞ –Ω–µ –æ—Ç –ø–µ—Ä–≤–∏—á–Ω–æ–≥–æ –∫–ª—é—á–∞ `transaction_id`, –∞ –æ—Ç –¥—Ä—É–≥–æ–≥–æ —Å—Ç–æ–ª–±—Ü–∞ - `product_id`. –ü–æ—ç—Ç–æ–º—É –¥–ª—è –ø–µ—Ä–µ—Ö–æ–¥–∞ –∫ 2–ù–§ —Ä–∞–∑–¥–µ–ª–∏–º —Ç–∞–±–ª–∏—Ü—ã _transactions_ –∏ _products_

–î–ª—è –Ω–∞—á–∞–ª–∞ –≤—ã–¥–µ–ª–∏–º –¥–∞—Ç–∞—Ñ—Ä–µ–π–º –¥–ª—è —Ç–∞–±–ª–∏—Ü—ã products. –ß—Ç–æ–±—ã –ª–æ–≥–∏–∫–∞ —Ä–∞–±–æ—Ç–∞–ª–∞, –Ω—É–∂–Ω–æ —á—Ç–æ–±—ã —Å–æ—á–µ—Ç–∞–Ω–∏–µ `brand` + `product_line` + `product_class` + `product_size` + `standart_cost` –±—ã–ª–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã–º –¥–ª—è –∫–∞–∂–¥–æ–≥–æ `product_id`. –ü—Ä–æ–≤–µ—Ä–∏–º

In [6]:
products_columns = ["product_id", "brand", "product_line", "product_class", "product_size", "standart_cost"]
print("–£–Ω–∏–∫–∞–ª—å–Ω—ã—Ö product_id:", transactions["product_id"].nunique())
print("–£–Ω–∏–∫–∞–¥—å–Ω—ã—Ö –ø—Ä–æ–¥—É–∫—Ç–æ–≤ –ø–æ —Ñ–∞–∫—Ç—É:", transactions.groupby(products_columns).ngroups )

–£–Ω–∏–∫–∞–ª—å–Ω—ã—Ö product_id: 101
–£–Ω–∏–∫–∞–¥—å–Ω—ã—Ö –ø—Ä–æ–¥—É–∫—Ç–æ–≤ –ø–æ —Ñ–∞–∫—Ç—É: 203

–í–∏–¥–∏–º, —á—Ç–æ –ø—Ä–æ–¥—É–∫—Ç–æ–≤ –Ω–∞ —Å–∞–º–æ–º –¥–µ–ª–µ –±–æ–ª—å—à–µ, —á–µ–º id –¥–ª—è –Ω–∞—à–µ–π —Ç–∞–±–ª–∏—Ü—ã. –í —Ç–∞–∫–æ–º —Å–ª—É—á–∞–µ —Å–≥–µ–Ω–µ—Ä–∏—Ä—É–µ–º —Å–≤–æ–π id

In [7]:
products = transactions.groupby(products_columns, as_index=False)["transaction_id"].count()\
                        .drop(columns=["product_id", "transaction_id"])\
                        .rename_axis(index="id")\
                        .reset_index()
products

,id,brand,product_line,product_class,product_size,standart_cost
0,0,Giant Bicycles,Standard,medium,large,528.43
1,1,Giant Bicycles,Standard,medium,medium,173.18
2,2,Norco Bicycles,Road,medium,medium,376.84
3,3,Norco Bicycles,Road,medium,medium,407.54
4,4,Norco Bicycles,Standard,low,medium,290.41
...,...,...,...,...,...,...
198,198,Trek Bicycles,Standard,high,medium,215.03
199,199,OHM Cycles,Standard,medium,medium,770.89
200,200,Trek Bicycles,Road,low,small,1531.42
201,201,Norco Bicycles,Road,medium,medium,206.35
202,202,Trek Bicycles,Standard,medium,small,1234.29

–ü—Ä–∏–≤–µ–¥—ë–º —Ç–∞–±–ª–∏—Ü—É `transactons` –∫ –Ω—É–∂–Ω–æ–º—É –Ω–∞–º –≤–∏–¥—É

In [8]:
# –û—Å—Ç–∞–≤–ª—è–µ–º —Ç–æ–ª—å–∫–æ –Ω—É–∂–Ω—ã–µ –Ω–∞–º –ø–æ–ª—è
transactions = transactions.drop(columns=products_columns)

#–ü—Ä–µ–æ–±—Ä–∞–∑—É–µ–º –ø–æ–ª–µ online_order –≤ –±–∏–Ω–∞—Ä–Ω–æ–µ (0/1)
transactions["online_order"] = transactions["online_order"].replace({False:0, True:1})

# –ü–µ—Ä–µ–∏–º–µ–Ω–æ–≤—ã–≤–∞–µ–º –∫–æ–ª–æ–Ω–∫—É transaction_id –≤ id
transactions = transactions.rename(columns={"transaction_id":"id"})

# –°–º–æ—Ç—Ä–∏–º —Ä–µ–∑—É–ª—å—Ç–∞—Ç
transactions.head(1)

   id  customer_id transaction_date  online_order order_status  list_price
0   1         2950       2017-02-25           0.0     Approved       71.49

–ü–µ—Ä–µ—Ö–æ–¥–∏–º –∫ –æ–±—Ä–∞–±–æ—Ç–∫–µ —Ç–∞–±–ª–∏—Ü—ã `customers`

In [9]:
# –ö–æ–Ω–≤–µ—Ä—Å—Ç–∏—Ä—É–µ–º DOB –≤ –¥–∞—Ç—É
customers["DOB"] = pd.to_datetime(customers["DOB"])

# –ü–µ—Ä–≤–æ–¥–∏–º –æ—Ç–≤–µ—Ç—ã –î–∞/–ù–µ—Ç –∫ –±–∏–Ω–∞—Ä–Ω–æ–º—É –≤–∏–¥—É—Ç
customers["deceased_indicator"] = customers["deceased_indicator"].replace({"N":0, "Y":1})
customers["owns_car"] = customers["owns_car"].replace({"No":0, "Yes":1})

# –ü–µ—Ä–µ–∏–º–µ–Ω–æ–≤—ã–≤–∞–µ–º –∫–æ–ª–æ–Ω–∫—É customer_id –≤ id
customers = customers.rename(columns={"customer_id":"id"})

# –°–º–æ—Ç—Ä–∏–º —Ä–µ–∑—É–ª—å—Ç–∞—Ç
customers.head(1)

,id,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12,Executive Secretary,Health,Mass Customer,0,1,060 Morning Avenue,2016,New South Wales,Australia,10

## –ó–∞–¥–∞–Ω–∏–µ 3. –°–æ–∑–¥–∞—Ç—å –≤—Å–µ —Ç–∞–±–ª–∏—Ü—ã –≤ DBeaver, —É–∫–∞–∑–∞–≤ –ø–µ—Ä–≤–∏—á–Ω—ã–µ –∫–ª—é—á–∏ –∫ —Ç–∞–±–ª–∏—Ü–∞–º, –ø—Ä–∞–≤–∏–ª—å–Ω—ã–µ —Ç–∏–ø—ã –¥–∞–Ω–Ω—ã—Ö, –º–æ–≥—É—Ç –ª–∏ –ø–æ–ª—è –±—ã—Ç—å –ø—É—Å—Ç—ã–º–∏ –∏–ª–∏ –Ω–µ—Ç

–°–æ–∑–¥–∞—ë–º —Å—Ö–µ–º—É store

In [10]:
execute_query("CREATE SCHEMA store")

–ó–∞–ø—Ä–æ—Å —É—Å–ø–µ—à–Ω–æ –≤—ã–ø–æ–ª–Ω–µ–Ω! üéâüéâüéâ

–°–æ–∑–¥–∞—ë–º —Ç–∞–±–ª–∏—Ü—É `products`

In [11]:
sql = """
CREATE TABLE store.products (
    id SERIAL PRIMARY KEY,
    brand VARCHAR(100),
    product_line VARCHAR(50),
    product_class VARCHAR(50),
    product_size VARCHAR(50),
    standard_cost DECIMAL(10, 2)
)
"""

execute_query(sql)

–ó–∞–ø—Ä–æ—Å —É—Å–ø–µ—à–Ω–æ –≤—ã–ø–æ–ª–Ω–µ–Ω! üéâüéâüéâ

–°–æ–∑–¥–∞—ë–º —Ç–∞–±–ª–∏—Ü—É `customers`

In [12]:
sql = """
CREATE TABLE store.customers (
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(100),
    last_name VARCHAR(100),
    gender VARCHAR(30),
    dob DATE,
    job_title TEXT,
    job_industry_category TEXT,
    wealth_segment VARCHAR(50),
    deceased_indicator SMALLINT,
    owns_car SMALLINT,
    address TEXT,
    postcode VARCHAR(30),
    state TEXT,
    country VARCHAR(100),
    property_valuation SMALLINT
)
"""

execute_query(sql)

–ó–∞–ø—Ä–æ—Å —É—Å–ø–µ—à–Ω–æ –≤—ã–ø–æ–ª–Ω–µ–Ω! üéâüéâüéâ

–°–æ–∑–¥–∞—ë–º —Ç–∞–±–ª–∏—Ü—É `transactions`

In [13]:
sql = """
CREATE TABLE store.transactions (
    id SERIAL PRIMARY KEY,
    product_id INT,
    customer_id INT,
    transaction_date DATE,
    online_order SMALLINT,
    order_status VARCHAR(50),
    list_price DECIMAL(10, 2)
)
"""

execute_query(sql)

–ó–∞–ø—Ä–æ—Å —É—Å–ø–µ—à–Ω–æ –≤—ã–ø–æ–ª–Ω–µ–Ω! üéâüéâüéâ

## –ó–∞–¥–∞–Ω–∏–µ 4. –ó–∞–≥—Ä—É–∑–∏—Ç—å –¥–∞–Ω–Ω—ã–µ –≤ —Ç–∞–±–ª–∏—Ü—ã –≤ —Å–æ–æ—Ç–≤–µ—Ç—Å—Ç–≤–∏–∏ —Å —Å–æ–∑–¥–∞–Ω–Ω–æ–π —Å—Ç—Ä—É–∫—Ç—É—Ä–æ–π

In [14]:
# –ó–∞–≥—Ä—É–∂–∞–µ–º –¥–∞–Ω–Ω—ã–µ –ø–æ –∫–ª–∏–µ–Ω—Ç–∞–º
customers.to_sql(schema="store", name="customers", con=engine, if_exists="replace", index=False)

# –ü—Ä–æ–≤–µ—Ä—è–µ–º
pd.read_sql("SELECT * FROM store.customers LIMIT 5", con=engine)

,id,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12,Executive Secretary,Health,Mass Customer,0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,1980-12-16,Administrative Officer,Financial Services,Mass Customer,0,1,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,3,Arlin,Dearle,Male,1954-01-20,Recruiting Manager,Property,Mass Customer,0,1,0 Holy Cross Court,4211,QLD,Australia,9
3,4,Talbot,None,Male,1961-10-03,None,IT,Mass Customer,0,0,17979 Del Mar Point,2448,New South Wales,Australia,4
4,5,Sheila-kathryn,Calton,Female,1977-05-13,Senior Editor,None,Affluent Customer,0,1,9 Oakridge Court,3216,VIC,Australia,9

In [15]:
# –ó–∞–≥—Ä—É–∂–∞–µ–º –¥–∞–Ω–Ω—ã–µ –ø–æ –ø—Ä–æ–¥—É–∫—Ç–∞–º
products.to_sql(schema="store", name="products", con=engine, if_exists="replace", index=False)

# –ü—Ä–æ–≤–µ—Ä—è–µ–º
pd.read_sql("SELECT * FROM store.products LIMIT 5", con=engine)

   id           brand product_line product_class product_size  standart_cost
0   0  Giant Bicycles     Standard        medium        large         528.43
1   1  Giant Bicycles     Standard        medium       medium         173.18
2   2  Norco Bicycles         Road        medium       medium         376.84
3   3  Norco Bicycles         Road        medium       medium         407.54
4   4  Norco Bicycles     Standard           low       medium         290.41

In [16]:
# –ó–∞–≥—Ä—É–∂–∞–µ–º –¥–∞–Ω–Ω—ã–µ –ø–æ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏—è–º
transactions.to_sql(schema="store", name="transactions", con=engine, if_exists="replace", index=False)

# –ü—Ä–æ–≤–µ—Ä—è–µ–º
pd.read_sql("SELECT * FROM store.transactions LIMIT 5", con=engine)

   id  customer_id transaction_date  online_order order_status  list_price
0   1         2950       2017-02-25           0.0     Approved       71.49
1   2         3120       2017-05-21           1.0     Approved     2091.47
2   3          402       2017-10-16           0.0     Approved     1793.43
3   4         3135       2017-08-31           0.0     Approved     1198.46
4   5          787       2017-10-01           1.0     Approved     1765.30